models/deepseek-v2-lite/benchmark_results/p50_sweep_20260315_072339/sweep.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72f0806599e0>, seed=42, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260315_072339', result_filename='qps1_20260315_072339.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-d324e817-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 07:26:16 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [03:30<00:00,  1.05s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  210.06    
Total input tokens:                      2773800   
Total generated tokens:                  50400     
Request throughput (req/s):              0.95      
Output token throughput (tok/s):         239.94    
Peak output token throughput (tok/s):    450.00    
Peak concurrent requests:                21.00     
Total token throughput (tok/s):          13445.02  
---------------Time to First Token----------------
Mean TTFT (ms):                          1213.31   
Median TTFT (ms):                        1053.28   
P50 TTFT (ms):                           1053.28   
P90 TTFT (ms):                           1798.05   
P95 TTFT (ms):                           1958.58   
P99 TTFT (ms):                           2365.32   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.75     
Median TPOT (ms):                        37.73     
P50 TPOT (ms):                           37.73     
P90 TPOT (ms):                           38.23     
P95 TPOT (ms):                           38.30     
P99 TPOT (ms):                           38.48     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.75     
Median ITL (ms):                         37.03     
P50 ITL (ms):                            37.03     
P90 ITL (ms):                            38.57     
P95 ITL (ms):                            40.08     
P99 ITL (ms):                            57.60     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          10687.40  
Median E2EL (ms):                        10557.79  
P50 E2EL (ms):                           10557.79  
P90 E2EL (ms):                           11341.15  
P95 E2EL (ms):                           11509.87  
P99 E2EL (ms):                           11848.32  
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7a48d23416c0>, seed=42, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260315_072339', result_filename='qps2_20260315_072339.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-c9f38915-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 07:31:12 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [01:58<00:00,  1.68it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  118.77    
Total input tokens:                      2773800   
Total generated tokens:                  50400     
Request throughput (req/s):              1.68      
Output token throughput (tok/s):         424.36    
Peak output token throughput (tok/s):    500.00    
Peak concurrent requests:                43.00     
Total token throughput (tok/s):          23779.28  
---------------Time to First Token----------------
Mean TTFT (ms):                          6964.85   
Median TTFT (ms):                        7059.61   
P50 TTFT (ms):                           7059.61   
P90 TTFT (ms):                           10829.18  
P95 TTFT (ms):                           11277.06  
P99 TTFT (ms):                           11912.65  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.37     
Median TPOT (ms):                        38.76     
P50 TPOT (ms):                           38.76     
P90 TPOT (ms):                           38.98     
P95 TPOT (ms):                           39.03     
P99 TPOT (ms):                           39.05     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.37     
Median ITL (ms):                         37.19     
P50 ITL (ms):                            37.19     
P90 ITL (ms):                            40.32     
P95 ITL (ms):                            44.97     
P99 ITL (ms):                            58.78     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          16595.06  
Median E2EL (ms):                        16827.74  
P50 E2EL (ms):                           16827.74  
P90 E2EL (ms):                           20535.00  
P95 E2EL (ms):                           21037.99  
P99 E2EL (ms):                           21534.79  
==================================================